//
// Created by 11868 on 2022/8/13.
//
#include<stdio.h>

int main() {
//
    int a[5][5] = {0};

    int(*p)[4];

    p = (int (*)[4]) a;

    printf("%d\n", &p[4][2]);
    printf("%d\n", &a[4][2]);
    printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);  //这个是指针的地址   地址      18-22=-4
    //把二维数组强制类型转换成(*p)[4]的过程就是把数组a所在的内存数据看成是行指针所指数据，
    // 换句话说就是直接把p指向了a的区域（事实上强制转换什么都没做）
    //其实就是差了一个int的字节
    //--------------------------------
    //%p是打印地址（指针地址）的，是十六进制的形式，但是会全部打完，即有多少位打印多少位。
    //--------------------------------
    int b[2];
    printf("%d", &b[1] - &b[0]); //1
    return 0;

}

